Catalogs/Банки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Банки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Банки/Forms/ФормаВыбораБанков/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Процедура заполняет список банков.
//
Процедура ЗаполнитьСписокБанков()

	РезультатЗапроса = Справочники.Банки.ПолучитьРезультатЗапросаПоКлассификатору(
		МФО,
		КоррСчет,
		Наименование,
		Город,
		Область
	);
	
	СписокБанков.Очистить();
    
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
    
    	НоваяСтрока = СписокБанков.Добавить();
    	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
    
    КонецЦикла;
    
КонецПроцедуры // ЗаполнитьСписокБанков()

&НаСервере
// Процедура добавляет выбранные банки в справочник "Банки".
//
// Возвращаемое значение:
//	Массив - Массив добавленных банков
//
Функция ДобавитьБанкиВСправочник()

	МассивБанков = Новый Массив;

	МассивНомеровСтрок = Элементы.СписокБанков.ВыделенныеСтроки;
	Для Каждого СтрокаТаблицы Из СписокБанков Цикл
	
		Если СтрокаТаблицы.Выбран Тогда
			
			НайденныйБанк = Справочники.Банки.НайтиПоКоду(СтрокаТаблицы.МФО);
			Если Не ЗначениеЗаполнено(НайденныйБанк) Тогда
				
				БанкОбъект = Справочники.Банки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(БанкОбъект, СтрокаТаблицы);
				БанкОбъект.Код = СтрокаТаблицы.МФО;
				БанкОбъект.Записать();
				
				МассивБанков.Добавить(БанкОбъект.Ссылка);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивБанков;

КонецФункции // ДобавитьБанкиВСправочник()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
// Процедура вызывается при нажатии кнопки "Подобрать банки".
//
Процедура ПодобратьБанкиВыполнить()

	ЗаполнитьСписокБанков();
	
КонецПроцедуры // ПодобратьБанкиВыполнить()

&НаКлиенте
// Процедура вызывается при нажатии кнопки "Добавить в справочник".
//
Процедура ДобавитьВСправочник(Команда)
	
	МассивБанков = ДобавитьБанкиВСправочник();
	
	Для Каждого Банк Из МассивБанков Цикл
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Банк);
		ПоказатьОповещениеПользователя(НСтр("ru='Добавлен новый банк:';uk='Доданий новий банк:'"),НавигационнаяСсылка);
	КонецЦикла;
	            
	//ОповеститьОВыборе("ОбновитьСписокБанков");
	 Оповестить("ОбновитьСписокБанков",,ЭтаФорма.ВладелецФормы);
	 Закрыть();
КонецПроцедуры // ДобавитьВСправочник()

&НаКлиенте
// Процедура вызывается при нажатии на кнопку "Выбрать все".
//
Процедура ВыбратьБанки(Команда)
	
	Для Каждого СтрокаТаблицы Из СписокБанков Цикл
		СтрокаТаблицы.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры // ВыбратьБанки()

&НаКлиенте
// Процедура вызывается при нажатии на кнопку "Исключить все".
//
Процедура ИсключитьБанки(Команда)
	
	Для Каждого СтрокаТаблицы Из СписокБанков Цикл
		СтрокаТаблицы.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры // ИсключитьБанки()

&НаКлиенте
// Процедура вызывается при нажатии на кнопку "Выбрать выделенные".
//
Процедура ВыбратьВыделенныеБанки(Команда)
	
	МассивСтрок = Элементы.СписокБанков.ВыделенныеСтроки;
	Для Каждого НомерСтроки Из МассивСтрок Цикл
		СписокБанков.НайтиПоИдентификатору(НомерСтроки).Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры // ВыбратьВыделенныеБанки()

&НаКлиенте
// Процедура вызывается при нажатии на кнопку "Исключить выделенные".
//
Процедура ИсключитьВыделенныеБанки(Команда)
	
	МассивСтрок = Элементы.СписокБанков.ВыделенныеСтроки;
	Для Каждого НомерСтроки Из МассивСтрок Цикл
		СписокБанков.НайтиПоИдентификатору(НомерСтроки).Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры // ИсключитьВыделенныеБанки()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "Выбор" поля ""СписокБанков".
//
Процедура СписокБанковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = СписокБанков.НайтиПоИдентификатору(ВыбраннаяСтрока);
	СтрокаТаблицы.Выбран = НЕ СтрокаТаблицы.Выбран;
	
КонецПроцедуры // СписокБанковВыбор()
